{
  "BACKSWING": {
    "id": "BACKSWING",
    "name": "Back Swing",
    "description": "A swingthrough where the in-air leg arcs starts behind the base leg, arcs upward past the base leg, and backward in the direction of movement. Also commonly known as a just \"Swingthrough\" or \"Swing\".",
    "aliases": [
      "backswing"
    ],
    "examples": [
      "Raiz (backswing) Gainer Flash"
    ]
  },
  "BOUND": {
    "id": "BOUND",
    "name": "Bound",
    "description": "The Bound can be described as an extension or modification of any of the previous three unified transition. That is, any unified transition that has an adjustment step on the ground before takeoff.",
    "aliases": [],
    "examples": [
      "Scoot (bound) Full Twist",
      "Aerial (bound) Pop 360"
    ]
  },
  "FRONTSWING": {
    "id": "FRONTSWING",
    "name": "Front Swing",
    "description": "A swingthrough where the in-air leg starts in front of the base leg, arcs downward past the base leg, and forward in the direction of movement.",
    "alias": [
      "frontswing",
      "fs"
    ],
    "examples": [
      "Aerial [Semi] (frontswing) Raiz"
    ]
  },
  "SWINGTHROUGH": {
    "id": "SWING",
    "name": "Swing",
    "description": "The Swingthrough (aka Swing) occurs when the in-air leg continues on a linear, unbroken path past the base leg, creating or maintaining momentum from the previous trick to the next.",
    "aliases": [
      "swing",
      "st"
    ],
    "examples": [
      "Raiz (backswing) Gainer Flash",
      "Aerial [Semi] (frontswing) Raiz",
      "Aerial (masterswing) GMS"
    ]
  },
  "VANISH": {
    "id": "VANISH",
    "name": "Vanish",
    "description": "The Vanish transition occurs when a sequential landing is followed by another sequential takeoff in the same order. (e.g. Left-Right, Left-Right or Right-Left, Right-Left)",
    "aliases": [
      "vanish",
      "vs"
    ],
    "examples": [
      "Butterfly Twist (vanish) Cheat 900",
      "540 (vanish) Aerial"
    ]
  },
  "WRAPTHROUGH": {
    "id": "WRAPTHROUGH",
    "name": "Wrapthrough",
    "description": "The Wrapthrough (aka wrap) can be seen as a type of swingthrough. It occurs when the outside leg \"wraps\" behind the base leg into an inside flip. In Vert Kicking, it is often used to name tricks that use the cheat takeoff that leave \"overcheated\" or in frontside.",
    "aliases": [
      "wrap",
      "wt"
    ],
    "examples": [
      "Cartwheel (wrap) Wrap Full",
      "540 (wrap) Wrap 900"
    ]
  },
  "SKIP": {
    "id": "SKIP",
    "name": "Skip",
    "description": "The Skip can be thought of as a vanish with an extra hop in-between the two tricks without ever having both feet touch at the same time",
    "aliases": [],
    "examples": [
      "Scoot (skip) Raiz",
      "Aerial (skip) Butterfly Twist"
    ]
  },
  "CARRYTHROUGH": {
    "id": "CARRYTHROUGH",
    "name": "Carry Through",
    "description": "The Carrythrough can be described as any of the previous singular transitions, but with a pivot / adjustment step during the transition. Can be seen as the singular equivalent of the \"bound\". This transition is often mistaken with the Frontswing.",
    "aliases": [
      "carrythrough",
      "ct"
    ],
    "examples": [
      "Tornado (carrythrough) Gainer Flash",
      "Aerial (carrythrough) Raiz"
    ]
  },
  "MISSLEG": {
    "id": "MISSLEG",
    "name": "Misleg",
    "description": "The Missleg occurs when the in-air leg travels towards the ground as if it were going to land, but chnages it's path by rebounding into the takeoff of the next trick, therefore \"missing\" the ground entirely.",
    "aliases": [],
    "examples": [
      "Sideswipe (missleg) Sideswipe",
      "Scoot (missleg) Butterfly Twist"
    ]
  },
  "REVERSAL": {
    "id": "REVERSAL",
    "name": "Reversal",
    "description": "The Reversal transition occurs when a sequential landing is followed by another sequential takeoff in the reverse order. (e.g Left-Right, Right-Left or Right-Left, Left-Right)",
    "aliases": [],
    "examples": [
      "Scoot (reversal) Aerial",
      "Cartwheel (reversal) GMS"
    ]
  },
  "POP": {
    "id": "POP",
    "name": "Pop",
    "description": "The Pop can be described as a sequential (one foot at a time) landing followed by a unified (two-foot) takeoff. It is differentiated by the punch by the timing and power absorption throughout the transition.",
    "aliases": [],
    "examples": [
      "Cartwheel (pop) Full Twist",
      "Scoot (pop) Full Twist"
    ]
  },
  "PUNCH": {
    "id": "PUNCH",
    "name": "Punch",
    "description": "The Punch can be described as a unified (two-foot) landing followed by a unified takeoff. The punch is traditionally utilized within gymnastics and tumbling and is characterized by an immediate takeoff without absorbing the impact of the landing.",
    "aliases": [],
    "examples": [
      "Roundoff (punch) Back Tuck",
      "Envergado (punch) Backside 900"
    ]
  },
  "RAPID": {
    "id": "RAPID",
    "name": "Rapid",
    "description": "The Rapid is a one-footed punch - or an instant jump off of one foot without absorbing the landing energy.",
    "aliases": [],
    "examples": [
      "Cheat 720 (rapid) Round",
      "Cartwheel Switch (rapid) Boneless Double Corkscrew"
    ]
  },
  "REVERSE_POP": {
    "id": "REVERSE_POP",
    "name": "Reverse Pop",
    "description": "The Reverse-Pop can be described as a unified (two-foot) landing followed by a sequential (one foot at a time) takeoff. Basically the literal opposite of the Pop transition.",
    "aliases": [],
    "examples": [
      "Parafuso (reverse-pop) Aerial",
      "Parafuso (reverse-pop) GMS"
    ]
  },
  "REDIRECT": {
    "id": "REDIRECT",
    "name": "Redirect",
    "description": "The Redirect transition occurs when a sequential landing is followed by an adjustment step and then another sequential takeoff. Could be thought of as a reversal with an extra step in between landing and takeoff.",
    "aliases": [],
    "examples": [
      "Sideswipe (redirect) Raiz",
      "Tornado (redirect) Swing 360"
    ]
  }
}